[
  ["Year" , "Date" , "Event"],
  [1902,"","Anushilan Samiti, organized revolutionary association formed."  ],
  [1903,"","British Expedition to Tibet"  ],
  [1903,"","Delhi Durbar Second Time."  ],
  [1904,"","University Act"  ],
  [1905,"16-Oct","Partition of Bengal"  ],
  [1906,"","Jugantar formed."  ],
  [1906,"30-Dec","Muslim League formed in Dacca."  ],
  [1907,"","Surat Split"  ],
  [1908,"","Alipore bomb case"  ],
  [1909,"","Morley-Minto Reforms"  ],
  [1911,"","Cancellation of Partition of Bengal"  ],
  [1911,"","Delhi Durbar Third Time"  ],
  [1911,"12-Dec","The British government moves the capital from Calcutta to Delhi.[27]"  ],
  [1912,"","Delhi conspiracy case"  ],
  [1913,"","Gadar Party formed."  ],
  [1913,"","Rabindranath Tagore won Nobel Prize in Literature"  ],
  [1914,"","Hindu–German Conspiracy"  ],
  [1915,"","Ghadar conspiracy"  ],
  [1915,"","Provisional Government of India formed in Kabul."  ],
  [1915,"","Mahatma Gandhi returns to India."  ],
  [1916,"","Lucknow Pact"  ],
  [1917,"","Champaran Satyagraha"  ],
  [1918,"","Kheda Satyagraha"  ],
  [1919,"","Jallianwala Bagh massacre"  ],
  [1919,"","Montagu–Chelmsford Reforms"  ],
  [1919,"","Rowlatt Act is passed"  ],
  [1920,"","Non-cooperation movement Khilafat Movement"  ],
  [1922,"05-Feb","Chauri Chaura incident"  ],
  [1924,"","The Hindustan Socialist Republican Association is formed."  ],
  [1925,"09-Aug","Kakori conspiracy"  ],
  [1927,"20-Mar","Mahad Satyagraha"  ],
  [1927,"November","Simon Commission"  ],
  [1928,"","Bardoli Satyagraha"  ],
  [1929,"","Central Assembly bombed by Bhagat Singh and Batukeshwar Dutt."  ],
  [1929,"","Purna Swaraj resolution."  ],
  [1930,"","Salt Satyagraha, the civil disobedience movement, begins with the Dandi march."  ],
  [1930,"","The first Round Table Conferences (India)"  ],
  [1931,"March","Gandhi–Irwin Pact"  ],
  [1931,"23-Mar","Bhagat Singh, Rajguru and Sukhdev martyred"  ],
  [1931,"September–December","The second Round Table Conferences (India)"  ],
  [1932,"24-Sep","Poona Pact"  ],
  [1932,"16-Aug","Communal Award"  ],
  [1932,"November–December","The third Round Table Conferences (India)"  ],
  [1935,"August","Government of India Act 1935"  ],
  [1937,"","Indian provincial elections, 1937"  ],
  [1939,"","The All India Forward Bloc established by Subhas Chandra Bose"  ],
  [1940,"23-Mar","Lahore Resolution"  ],
  [1940,"08-Aug","August offer 1940"  ],
  [1942,"late March","Cripps' mission"  ],
  [1942,"August","1. Quit India movement"  ],
  [1942,"","2. The Indian National Army is established by Subhas Chandra Bose."  ],
  [1943,"","Arzi Hukumat-e-Azad Hind, the Provisional Government of Free India is formed by Netaji."  ],
  [1944,"","Subhas Chandra Bose calls Mahatma Gandhi the Father of the Nation."  ],
  [1945,"","Wavell Plan, Simla Conference"  ],
  [1946,"February","Royal Indian Navy Mutiny"  ],
  [1946,"March","Cabinet Mission"  ],
  [1946,"16-Aug","Direct Action Day/Great Calcutta Killings"  ],
  [1947,"July","Indian Independence Act 1947 by British Raj"  ],
  [1947,"","Partition of India and Pakistan becomes an independent state on 14 August 1947.[26]"  ],
  [1947,"","Freedom from British Raj."  ],
  [1947,"","Hundreds of thousands die in widespread communal bloodshed after partition, continuing to 1948."  ],
  [1948,"30-Jan","Mahatma Gandhi assassinated by Nathuram Godse."  ],
  [1948,"","War with Pakistan over disputed territory of Kashmir."  ],
  [1948,"","Telangana and other princely states are integrated into Indian union."  ],
  [1950,"26-Jan","India became a republic."  ],
  [1951,"","Congress Party wins first general elections under leadership of Jawaharlal Nehru (to 1952)."  ],
  [1955,"","Nationalisation of the Indian insurance sector. Establishment of LIC."  ],
  [1956,"14-Oct","B. R. Ambedkar converted to Buddhism along with 600,000 followers."  ],
  [1956,"06-Dec","B. R. Ambedkar passed away."  ],
  [1962,"","War over disputed territory of Kashmir[26] with China."  ],
  [1962,"","India seizes Diu, Daman and Goa from Portuguese India."  ],
  [1964,"27-May","Death of Prime Minister Jawaharlal Nehru."  ],
  [1965,"6–23 September","Second war with Pakistan over Kashmir."  ],
  [1966,"","Nehru's daughter Indira Gandhi becomes prime minister."  ],
  [1971,"","Third war with Pakistan over creation of Bangladesh, formerly East Pakistan."  ],
  [1971,"","Twenty-year treaty of friendship signed with Soviet Union."  ],
  [1974,"","India explodes first nuclear device in underground test."  ],
  [1975,"","Indira Gandhi declares a state of emergency after being found guilty of electoral malpractice."  ],
  [1975,"","Nearly 1,000 political opponents imprisoned and programme of compulsory birth control introduced. (to 1977)"  ],
  [1977,"","Indira Gandhi's Congress Party loses general elections. Janata Party comes to power. The Communist party of India comes into power in West Bengal."  ],
  [1979,"","The Janata Party splits. Chaudhary Charan Singh becomes Prime Minister."  ],
  [1980,"","Indira Gandhi returns to power heading the Congress party splinter group, Congress (Indira)."  ],
  [1983,"","N. T. Rama Rao NTR's nine-month-old Telugu Desam assumes power in AP becoming a challenger post Loknayak Jayprakash Narayan against Indira Gandhi."  ],
  [1983,"","India won 1st World Cup in one day international Cricket led by Kapil Dev."  ],
  [1984,"","Troops storm Golden Temple, the Sikhs' most holy shrine, after Jarnail Singh Bhindranwale seeks refuge inside. There are a movement to flush out Sikh separatism and calls for secularism, called Operation Blue Star. \"Anti-Sikh Riots 1984\"."  ],
  [1984,"","Indira Gandhi is assassinated by her Sikh bodyguards; her son, Rajiv, takes over."  ],
  [1984,"","Many Sikhs were killed due to the assassination of Indira Gandhi. see 1984 anti-Sikh riots."  ],
  [1987,"","India deploys troops for peacekeeping operation in Sri Lanka's ethnic conflict."  ],
  [1988,"","SEBI was established by The Government of India on 12 April 1988 and given statutory powers in 1992 with SEBI Act 1992 being passed by the Indian Parliament."  ],
  [1989,"","Falling public support leads to a Congress defeat in general election."  ],
  [1989,"","The National Front (India), headed by V. P. Singh and led by Janata Dal, is formed and storms into power with outside support from BJP and CPI."  ],
  [1990,"","Muslim separatist groups begin campaign of violence in Kashmir."  ],
  [1991,"","Rajiv Gandhi is assassinated by a suicide bomber sympathetic to Sri Lanka's Tamil Tigers."  ],
  [1991,"","An economic reform programme is begun by Prime Minister P.V. Narasimha Rao."  ],
  [1992,"","Babri Mosque in Ayodhya is demolished, triggering widespread Hindu-Muslim violence."  ],
  [1992,"","Over 200 people die in Cuttack in Odisha, after drinking illegally brewed liquor in the 1992 Odisha liquor deaths incident."  ],
  [1995,"July","West Bengal Chief Minister Jyoti Basu made the first call from Kolkata to inaugurate the cellular services in India."  ],
  [1996,"","Congress suffers its worst electoral defeat ever as BJP emerges as the largest single party."  ],
  [1996,"August","The Amarnath Yatra tragedy in which at least 194 pilgrims are reported to have frozen to death in northern Kashmir after being stranded by violent rain and snow storms."  ],
  [1998,"","BJP forms coalition government under Prime Minister Atal Bihari Vajpayee."  ],
  [1998,"","India and Pakistan carry out nuclear tests, leading to widespread international condemnation."  ],
  [1999,"February","Vajpayee makes a historic bus trip to Pakistan to meet Premier Nawaz Sharif and to sign bilateral Lahore peace declaration."  ],
  [1999,"May","Tension in Kashmir leads to a brief war with Pakistan-backed forces in the icy heights around Kargil in Indian-administered Kashmir."  ],
  [1999,"October","The Cyclone devastates eastern state of Odisha, leaving at least 10,000 dead."  ],
  [2000,"March","US President Bill Clinton makes a groundbreaking visit to improve ties."  ],
  [2000,"May","India marks the birth of its billionth citizen."  ],
  [2000,"November","The states of Jharkhand, Chhattisgarh & Uttranchal (Uttrakhand) were created on 15 November 2000."  ],
  [2001,"","A high-powered rocket is launched, adding India to the club of countries able to fire big satellites deep into space."  ],
  [2001,"26-Jan","The 7.7 Mw? Gujarat earthquake shakes Western India with a maximum Mercalli intensity of X (Extreme), leaving 13,805–20,023 dead and about 166,800 injured."  ],
  [2001,"July","Vajpayee meets Pakistani President Pervez Musharraf in the first summit between the two neighbours in more than two years. The meeting ends without a breakthrough or even a joint statement because of differences over Kashmir."  ],
  [2001,"July","Vajpayee's BJP party declines his offer to resign over a number of political scandals and the apparent failure of his talks with Pakistani President Musharraf."  ],
  [2001,"September","US lifts sanctions which it imposed against India and Pakistan after they staged nuclear tests in 1998. The move is seen as a reward for their support for the US-led anti-terror campaign."  ],
  [2001,"October","India and Pakistan fire at each other's military posts in the heaviest firing along the dividing line of control in Kashmir for almost a year.[28]"  ],
  [2001,"October","Pakistani forces shelled the village of Arnia about three km (two miles) from the border in the early hours of Monday June 6, killing five and wounding at least two dozen civilians.[28]"  ],
  [2001,"December","Suicide squad attacks parliament in New Delhi, killing several police. The five gunmen die in the assault."  ],
  [2001,"December","India imposes sanctions against Pakistan, to force it to take action against two Kashmir militant groups blamed for the suicide attack on parliament. Pakistan retaliates with similar sanctions, and bans the groups in January."  ],
  [2001,"December","India, Pakistan mass troops on common border amid mounting fears of a looming war."  ],
  [2002,"","War of words between Indian and Pakistani leaders intensifies. Actual war seems imminent."  ],
  [2002,"January","India successfully test-fires a nuclear-capable ballistic missile – the Agni – off its eastern coast."  ],
  [2002,"February","Inter-religious bloodshed breaks out after 59 Hindu pilgrims returning from Ayodhya are killed in a train fire in Godhra, Gujarat. More than 1,000 people, die in subsequent riots. (Police and officials blamed the fire on a Muslim mob; a 2005 government investigation said it was an accident, though later court and SIT report held Muslim mob responsible.)"  ],
  [2002,"May","Pakistan test-fires three medium-range surface-to-surface Ghauri missiles, which are capable of carrying nuclear warheads."  ],
  [2002,"June","UK, US urge their citizens to leave India and Pakistan, while maintaining diplomatic offensive to avert war."  ],
  [2002,"July","Retired scientist and architect of India's missile programme A.P.J. Abdul Kalam is elected president."  ],
  [2003,"August","At least 50 people are killed in two simultaneous bomb blasts in Bombay."  ],
  [2003,"November","India matches Pakistan's declaration of a Kashmir ceasefire."  ],
  [2003,"December","India, Pakistan agree to resume direct air links and to allow overflights."  ],
  [2004,"January","Groundbreaking meeting is held between government and moderate Kashmir separatists."  ],
  [2004,"May","Surprise victory for Congress Party in general elections. Manmohan Singhis sworn in as prime minister."  ],
  [2004,"September","India, along with Brazil, Germany and Japan, launches an application for a permanent seat on the UN Security Council."  ],
  [2004,"November","India begins to withdraw some of its troops from Kashmir."  ],
  [2004,"December","Thousands are killed when tsunami, caused by the 2004 Indian Ocean earthquake off the Indonesian coast, devastate coastal communities in the south and in the Andaman and Nicobar Islands."  ],
  [2005,"July","More than 1,000 people are killed in floods and landslides caused by monsoon rains in Mumbai (Bombay) and Maharashtra region."  ],
  [2005,"08-Oct","The 7.6 Mw? Kashmir earthquake strikes with a maximum Mercalli intensityof VIII (Severe), leaving 86,000–87,351 people dead, 69,000–75,266 injured, and 2.8 million homeless."  ],
  [2006,"February","India's largest-ever rural jobs scheme is launched, aimed at lifting around 60 million families out of poverty."  ],
  [2006,"March","US and India sign a nuclear agreement during a visit by US President George W Bush. The US gives India access to civilian nuclear technology while India agrees to greater scrutiny for its nuclear programme."  ],
  [2007,"February","India and Pakistan sign an agreement aimed at reducing the risk of accidental nuclear war."  ],
  [2007,"18-Feb","68 passengers, most of them Pakistanis, are killed by bomb blasts and a blaze on a train travelling from New Delhi to the Pakistani city of Lahore."  ],
  [2007,"March","Maoist rebels in Chhattisgarh state kill more than 50 policemen in a dawn attack."  ],
  [2007,"April","India's first commercial space rocket is launched, carrying an Italian satellite."  ],
  [2007,"May","Government announces its strongest economic growth figures for 20 years – 9.4% in the year to March."  ],
  [2007,"May","At least nine people are killed in a bomb explosion at the main mosque in Hyderabad. Several others are killed in subsequent rioting."  ],
  [2007,"July","India says the number of its people with HIV or AIDS is about half of earlier official tallies. Health ministry figures put the total at between 2 million and 3.1 million cases, compared with previous estimates of more than 5 million."  ],
  [2007,"July","Pratibha Patil becomes first woman to be elected president of India."  ],
  [2008,"July","Series of explosions kills 49 in Ahmedabad, in Gujarat state. The little-known terrorist group Indian Mujahideen claims responsibility."  ],
  [2008,"October","Following approval by the US Congress, President George W Bush signs into law a nuclear deal with India, which ends a three-decade ban on US nuclear trade with Delhi."  ],
  [2008,"October","India successfully launches its first mission to the moon, the unmanned lunar probe Chandrayaan-1."  ],
  [2008,"November","The 2008 Mumbai attacks (often called the 26/11 attacks) kill 174 people, including 9 of the 10 terrorists from Lashkar-e-Taiba, an Islamic terrorist organisation based in Pakistan. India decides not to attack Pakistan in retaliation."  ],
  [2008,"December","India announces \"pause\" in peace process with Pakistan. Indian cricket team cancels planned tour of Pakistan."  ],
  [2009,"February","India and Russia sign deals worth $700 million, according to which Moscow will supply Uranium to Delhi."  ],
  [2009,"April","Trial of sole surviving suspect Ajmal Kasab in Mumbai attacks begins."  ],
  [2009,"May","Resounding general election victory gives governing Congress-led alliance of PM Manmohan Singh an enhanced position in parliament, only 11 seats short of an absolute majority."  ],
  [2009,"July","Delhi court decriminalizes gay sex"  ],
  [2010,"February","16 people are killed in a bomb explosion at German Bakery in the city of Pune, Maharashtra."  ],
  [2010,"May","Surviving gunman of 2008 Mumbai attacks is convicted of murder, possession of explosives and waging war."  ],
  [2011,"April","India wins cricket world cup after 28 years under the captaincy of Mahendra Singh Dhoni."  ],
  [2011,"May","After 34 years of Left Front Government, Trinamool Congress and Congress alliance come to power in West Bengal."  ],
  [2012,"July","Pranab Mukherjee, the former Finance Minister is elected as the 13th president of India."  ],
  [2012,"November","Ajmal Kasab the lone surviving gunman of 2008 Mumbai attacks is hanged on 21 November 2012 at 7:30 in at Yerwada Jail."  ],
  [2013,"12-Feb","Indian helicopter bribery scandal comes to light."  ],
  [2013,"21-Feb","Terror attacks in Hyderabad in Dilsukhnagar area."  ],
  [2013,"05-Nov","Mars Orbiter Mission, is successfully launched into Mars orbit by the Indian Space Research Organisation (ISRO).[29][30][31]"  ],
  [2014,"16-May","Narendra Modi elected as prime minister of India, Congress was routed in the general elections."  ],
  [2014,"02-Jun","Telangana, The state of Telangana was officially formed on 2 June 2014."  ],
  [2016,"2–5 January","Terror Attacks on Pathankot Air Base.[32]"  ],
  [2016,"27-Jun","India becomes a member of Missile Technology Control Regime."  ],
  [2016,"07-Jun","Unrest in Kashmir."  ],
  [2016,"27-Sep","India launches its first space laboratory Astrosat in its biggest project since its Mars orbiter mission in 2014."  ],
  [2016,"23-Sep","India signs a billion-dollar defence deal with France to buy 36 Rafale fighter jets."  ],
  [2016,"08-Nov","In a surprise announcement, the government withdraws high denomination notes from circulation causing chaotic scenes at banks across the country as customers try to exchange old notes."  ],
  [2017,"30-Jun","The Goods and Services Tax (GST) launched, the biggest tax reform in history of India."  ]
]
