[
    ["Date" , "Type" , "Death" , "Injured" , "Location" , "Details" , "Perpetrator" , "Part of"],
      ["29 July 1900","Assassination","1","0","Monza, Italy","Gaetano Bresci, an Italian-American Anarchist, assassinated Umberto I of Italy","Gaetano Bresci",""  ],
      ["15 April 1902","Assassination","1","0","St.Petersburg, Russia","Minister of the Interior Dmitry Sipyagin was assassinated in the Marinsky Theatre.","Stepan Balmashov",""  ],
      ["28 April – 1 May 1903","Bombings","0 (+4)","","Thessaloniki, Ottoman Empire","Members of the Boatmen of Thessaloníki, a Bulgarian anarchist group, carried out a series of bombings in Thessaloniki","Boatmen of Thessaloníki",""  ],
      ["18 May 1904","Kidnapping","0","2 kidnapped","Morocco","Ion Perdicaris and Cromwell Varley were kidnapped and held for ransom by bandit Mulai Ahmed er Raisuli in Morocco.[4]","Mulai Ahmed er Raisuli",""  ],
      ["15 February 1905","Bombing","2","1+","Russia","Assassination of Grand Duke Serge Alexandrovich Romanov by Socialist-revolutionaries. His coach driver Andrei Rudinkin was also killed.","Ivan Kalyayev",""  ],
      ["25 August 1906","Bombing","28","Several","Aptekarsky Island, Russia","28 people were killed when three terrorists bombed a reception in an attempt to assassinate Pyotr Stolypin.","Union of Socialists Revolutionaries Maximalists",""  ],
      ["11/12 July 1908","Bombing","1","23","Malmö, Sweden","Night between 11 and 12 July: Bombing of the boat Amalthea where British strikebreakers lived by Anton Nilsson One was killed and 23 wounded.","Anton Nilsson",""  ],
      ["1 October 1910","Bombing","21","105+","Los Angeles, United States","Los Angeles Times bombing killed 21 people and wounded over 100 others.","Lone wolf (terrorism)",""  ],
      ["14 September 1911","Shooting","1","0","Kiev, Russia","Assassination of Pyotyr Stolypin Russian Prime Minister.","Dmitri Bogrov",""  ],
      ["1912-14","Various","1","0","United Kingdom","Protest campaign by militant suffragettes campaigning for women's right to vote, including acts of disruption and violence aimed at property","Women's Social and Political Union",""  ],
      ["28 June 1914","Shooting","2","1","Sarajevo, Austria-Hungary","Assassination of Archduke Franz Ferdinand heir to the Austro-Hungarian throne.","Gavrilo Princip",""  ],
      ["22 July 1916","Bombing","10","40","San Francisco, United States","Preparedness Day Bombing was a bombing in San Francisco, California on 22 July 1916, when the city held a parade in anticipation of the United States' entry into World War I. During the parade, a suitcase bomb was detonated, killing ten and wounding forty.","Galleanist Anarchists (suspected)",""  ],
      ["16 September 1920","Bombing","38","300","New York City, United States","Wall Street bombing killed 38 people and wounded 300 others.[5]","Galleanist Anarchists (suspected)","Red Scare"  ],
      ["14 October 1920","Bombings","1","10","Trieste, Italy","In Trieste, nationalists threw six bombs at the editorial office of a Socialist newspaper, resulting in one death and ten injuries.[6]","Italian Nationalists",""  ],
      ["15 October 1920","Bombings","0","2","Milan, Italy","In Milan, anarchists were responsible for throwing two bombs at a hotel holding a British delegation attending the Milan International Conference; there were two injuries.[6]","Anarchists",""  ],
      ["8 December 1920","Bombing","3","3","Bucharest, Romania","A bomb placed by a left-wing terrorist group blows up in the Romanian Senate, killing the Minister of Justice and two other senators. Likewise, President of the Senate and two Orthodox bishops were severely injured.","Max Goldstein, Leon Lichtblau and Saul Ozias",""  ],
      ["31 May 1921","Riot","39-300","800+","Tulsa, United States","The Tulsa race riot killed at least 39 people and injured over 800.[7]","Ku Klux Klan",""  ],
      ["13 December 1921","Bombing","100","","Bolgrad, Romania","The Bolgrad palace bombing occurred when a bomb thrown by Bessarabian separatists at the Bolgrad palace, killed 100 soldiers and police officers.[8]","Bessarabian separatists","Union of Bessarabia with Romania"  ],
      ["31 October 1923","Shooting","1","1","Dublin, Irish Free State","Far-right extremists shot two Jewish men as they walked across St. Stephen's Green in Dublin. One of the men was killed.[9]","Far-right extremists",""  ],
      ["16 April 1925","Bombing","150","~500","Sofia, Bulgaria","St Nedelya Church assault – The Bulgarian Communist Party (BCP) blew up the church's roof during the funeral service of General Konstantin Georgiev, who had been killed in a previous Communist assault on 14 April. 150 people, mainly from the country's political and military elite, were killed in the attack and around 500 were injured.[10]","Bulgarian Communist Party",""  ],
    
      ["28 July 1835","Shooting","18","22 (+1)","France","Giuseppe Marco Fieschi used a volley gun to attack the royal entourage of King Louis-Philippe of France during the annual review of the National Guard as part of a revolutionary plot. Fieschi was badly injured when four of the weapon's barrels exploded and was captured soon after. He was executed with co-conspirators Pierre Morey and Theodore Pépin on 19 February 1836.","Giuseppe Marco Fieschi",""  ],
      ["14 April 1865","Assassination, shooting, stabbing","1","8 (+1)","United States","President Abraham Lincoln was assassinated by John Wilkes Booth at Ford's Theatre in Washington D.C. Booth's co-conspirators were to launch simultaneous attacks on Vice President Andrew Johnson and Secretary of State William H. Seward, but Seward's attacker failed to kill him and Johnson's lost his nerve. Booth was killed after a 12-day manhunt, and several of his co-conspirators were later arrested and executed.","John Wilkes Booth and co-conspirators","American Civil War"  ],
      ["1865–1877","Murders","c. 3,000","Several","United States","c. 3,000 Freedmen and their Republican Party allies are killed by the Ku Klux Klan and well-organized campaigns of violence by other local whites in a campaign of terrorist violence that weakened the reconstructionist governments in the Southern United States and helped re-establish legitimized segregation.[2][3]","Ku Klux Klan","Reconstruction Era"  ],
      ["13 December 1867","Prison escape","12","120","United Kingdom","The \"Clerkenwell Outrage\": a bomb exploded next to a wall of Clerkenwell Prison as an attempt to abet the escape of an arms dealer.","Fenian Society",""  ],
      ["1880","Attempted Assassination","0","0","Russia","Attempted assassination of General Mikhail Loris-Melikov.","Anarchists (suspected)",""  ],
      ["1881","Assassination by Bombing","2","12","St.Petersburg, Russia","Assassination of Tsar Alexander II of Russia.","Narodnaya Volya",""  ],
      ["1881-5","Bombing","0 (+3)","98","United Kingdom","Fenian dynamite campaign.","Irish Republican Brotherhood",""  ],
      ["1884","Assassination","2","0","Russia","Assassination of Colonel Soudekine, Chief of Police.","Nihilist movement",""  ],
      ["4 May 1886","Bombing","7 (+4)","160+","Chicago","Haymarket Affair. A peaceful rally in Haymarket, Chicago, Illinois, was disrupted when a bomb was detonated as police were dispersing the public demonstration.","FOTLU",""  ],
      ["23 July 1892","Assassination attempt","0","1 (+1)","Pittsburgh","Alexander Berkman, a Russian expatriate, attempted to assassinate Henry Clay Frick, an American industrialist, financier, and art patron, in Pittsburgh. Berkman was arrested and Frick survived. Berkman claims inspiration from the Haymarket Affair.","Alexander Berkman",""  ],
      ["9 December 1893","Bombing","0","20","Paris","French anarchist Auguste Vaillant bombed the French Chamber of Deputies injuring 20 deputies.","Auguste Vaillant",""  ],
      ["24 June 1894","Assassination","1","0","Lyon","French president Marie François Sadi Carnot is fatally stabbed by Italian anarchist Sante Geronimo Caserio.","Sante Geronimo Caserio",""  ],
      ["26 August 1896","Hijacking","10+","0","Constantinople, Ottoman Empire","Occupation of the Ottoman Bank by Armenian separatists. A resulting anti-Armenian pogrom killed around 6,000 individuals.","Armenian Revolutionary Federation",""  ]
        
]