[
  ["Name" , "Year" , "Details"],
  ["Rendering of a planned highway",1960,"In 1960, a 49-second vector animation of a car traveling down a planned highway at 110 km/h was created at the Swedish Royal Institute of Technology on the BESK computer. The short animation was broadcast on November 9, 1961 on national television.[1][2]"  ],
  ["Hummingbird",1967,"A ten-minute computer animated film by Charles Csuri and James Shaffer. This was awarded a prize at the 4th annual International Experimental Film Competition in Brussels, Belgium and in the collection of The Museum of Modern Art, New York City. The subject was a line drawing of a hummingbird for which a sequence of movements appropriate to the bird were programmed. Over 30,000 images comprising some 25 motion sequences were generated by the computer.[3][4]"  ],
  ["Kitty",1968,"A group of Soviet mathematicians and physicists headed by N. Konstantinov created a mathematically computable model of the physics of a moving cat. The algorithms were programmed on the BESM-4 computer. The computer then printed hundreds of frames to be later converted to film.[5][6][7] An accompanying scientific paper describes the foundation of the employed physics simulation techniques that nowadays are commonly applied to animation films and computer games.[8]"  ],
  ["Metadata",1971,"This is an experimental 2D animated short drawn on a data tablet by Peter Foldes, who used the world's first key frame animation software, invented by Nestor Burtnyk and Marceli Wein.[9][10][11][12]"  ],
  ["A Computer Animated Hand",1972,"Produced by Ed Catmull, the short demonstrates a computer animated hand, as well as human faces. Added to the United States National Film Registry in 2011."  ],
  ["Westworld",1973,"First use of 2D computer animation in a significant entertainment feature film. The point of view of Yul Brynner's gunslinger was achieved with raster graphics.[13][14]"  ],
  ["Faces (Faces & Body Parts)",1974,"Fred Parke's thesis film on facial modeling at the University of Utah.[15]"  ],
  ["Great",1975,"The Oscar-winning 1975 short animated film about the life of the Victorian engineer Isambard Kingdom Brunel contains a brief sequence of a rotating wire-frame model of Brunel's final project, the iron steam ship SS Great Eastern."  ],
  ["Futureworld",1976,"First use of 3D computer graphics for animated hand and face. Used 2D digital compositing to materialize characters over a background.[14]"  ],
  ["Star Wars",1977,"Used an animated 3D wire-frame graphic for the trench run briefing sequence. Added to the United States National Film Registry in 1989."  ],
  ["The Black Hole",1979,"Used raster wire-frame model rendering for the open credits depicting a 3D wireframe of a black hole.[16]"  ],
  ["Alien",null,"Used raster wire-frame model rendering for navigation monitors in the landing sequence.[14] Added to the United States National Film Registry in 2002."  ],
  ["Looker",1981,"First CGI human character, Cindy. Also, first use of 3D-shaded CGI.[16][17]"  ],
  ["The Works",1982,"The New York Institute of Technology Computer Graphics Labpremiered a trailer at SIGGRAPH for their CGI project. This would have been the first feature-length CGI film, but it was never completed."  ],
  ["Star Trek II: The Wrath of Khan",1982,"ILM computer graphics division develops \"Genesis Effect\", the first use of a fractal-generated landscape in a film.[18] Bill Reeves leads the Genesis Effect programming team, and creates a new graphics technique called \"Particle Systems\"."  ],
  ["Tron",1982,"First extensive use (15 minutes fully computer generated) of 3D CGI including the famous Light Cycle sequence.[19] Also includes very early facial animation (for the Master Control Program)."  ],
  ["Golgo 13",1983,"First animated film to incorporate CGI sequences.[20] Entirely digital models of revolvers, skeletons, helicopters, and skyscrapers (created by Toyo Links Corporation and Osaka University's CG division) are used in the film's title sequence and part of the climax; the remainder of the film is traditionally animated by Tokyo Movie Shinsha."  ],
  ["Dream Flight",1983,"First 3D generated film telling a story, shown in Electronic Theater in SIGGRAPH  83"  ],
  ["Rock & Rule",1983,"First Western animated film to use computer graphics.[21]"  ],
  ["The Last Starfighter",1984,"Uses CGI for all spaceship shots, replacing traditional models. First use of \"integrated CGI\" where the effects are supposed to represent real world objects.[21]"  ],
  ["Lensman: Secret of The Lens",1984,"Uses CGI for spaceships and other scenes."  ],
  ["The Adventures of Andr  and Wally B.",1984,"Lucasfilm's computer animation division creates an all-CGI-animated short. The first CGI animation with motion blur effects and squash and stretch motion."  ],
  ["2010: The Year We Make Contact",1984,"Jupiter's turbulent atmosphere is CGI-rendered, mostly during the black spot shots."  ],
  ["Tony de Peltrie",1985,"First CGI-animated human character to express emotion through his face and body language.[22]"  ],
  ["Young Sherlock Holmes",1985,"Lucasfilm creates the first photorealistic CGI character, \"stained glass knight\" with 10 seconds of screentime.[23][21]"  ],
  ["\"Money for Nothing\"",1985,"The first computer-generated music video.[21] The animators would go on to found Mainframe Entertainment."  ],
  ["Flight of the Navigator",1986,"The first use of reflection mapping in a feature film, used for the flying alien spacecraft.[21]"  ],
  ["Labyrinth",1986,"First realistic CGI animal.[21]"  ],
  ["Star Trek IV: The Voyage Home",1986,"First use of the Cyberware 3D scanner, first 3D morphing.[21]"  ],
  ["Luxo Jr.",1986,"First use of shadows in CGI, made with the specially developed software Photorealistic Renderman. First Pixar film, and first CGI film to be nominated for an Academy Award. Added to the United States National Film Registry in 2014."  ],
  ["The Golden Child",1986,"First use of primitive photorealistic morphing.[24]"  ],
  ["Captain Power and the Soldiers of the Future",1987,"First TV series to include characters modeled entirely with computers."  ],
  ["Knightmare",1987,"First game show with interaction between humans and computer-generated surroundings."  ],
  ["Rendez-vous in Montreal",1987,"First 3D generated film involving virtual actors Marilyn Monroe and Humphrey Bogart"  ],
  ["Willow",1988,"First extensive photorealistic use of morphing effect in a feature film.[25]"  ],
  ["Akira",1988,"CGI is used to animate the pattern indicator, and to plot the paths of falling objects, model parallax effects on backgrounds, and tweak lighting and lens flares.[20]"  ],
  ["Tin Toy",1988,"First computer-animated short film to win an Oscar. Added to the United States National Film Registry in 2003."  ],
  ["The Abyss",1989,"First digital 3D water effect.[26]"  ],
  ["The Jim Henson Hour",1989,"TV series with real-time and rendered CGI featuring digitally puppeteered CG character \"Waldo.\""  ],
  ["Indiana Jones and the Last Crusade",1989,"First all-digital composite.[26]"  ],
  ["Les Fables g om triques",1989,"First broadcast series of animated CGI shorts."  ],
  ["Die Hard 2",1990,"First digitally-manipulated matte painting.[26]"  ],
  ["RoboCop 2",1990,"An early use of real-time computer graphics or \"digital puppetry\" to create a character in a motion picture.[27]"  ],
  ["Backdraft",1991,"First use of photorealistic CGI fire in a motion picture.[27]"  ],
  ["Terminator 2: Judgment Day",1991,"First realistic human movements on a CGI character.[26] The first partially computer-generated main character and the first blockbuster movie to feature multiple morphing effects.[28] First use of a personal computer to create major movie 3D effects."  ],
  ["Death Becomes Her",1992,"First human skin CGI software.[26]"  ],
  ["The Lawnmower Man",1992,"First feature film to use computer animation to explore the subject of virtual reality. First virtual reality sex.[29]"  ],
  ["Jurassic Park",1993,"First photorealistic CG creatures.[26]"  ],
  ["The Incredible Crash Dummies",1993,"First fully CG animated TV \"Special\". It filled a half hour time slot and ran repeatedly on Fox Kids during their Saturday morning lineup. It was later repacked as a video to be sold with action figures of the same branding."  ],
  ["Live & Kicking",1993,"First TV program to feature a live computer-generated character as part of its cast."  ],
  ["VeggieTales",1993,"First completely computer animated direct-to-video release."  ],
  ["Babylon 5",1993,"First television series to use CGI as the primary method for its visual effects. First TV use of virtual sets."  ],
  ["Insektors[30]",1993,"First fully computer animated TV series. First use of character animation in a computer animated television series."  ],
  ["Radioland Murders",1994,"First use of virtual CGI sets with live actors.[31]"  ],
  ["ReBoot",1994,"First half-hour computer animated TV series.[32]"  ],
  ["The Flintstones",1994,"First CGI-rendered fur.[26]"  ],
  ["The Crow",1994,"First deceased actor (Brandon Lee) to be re-created through CGI."  ],
  ["Waterworld",1995,"First realistic CG water.[26]"  ],
  ["Casper",1995,"First CGI lead character in a feature-length live-action film, and first CGI characters to interact realistically with live actors."  ],
  ["Toy Story",1995,"First CGI feature-length animation. Added to the United States National Film Registry in 2005."  ],
  ["Cassiopeia",1996,"A Brazilian CGI animated feature film produced and released by NDR Filmes in Brazil on April 1, 1996. First CGI feature-length animation that did not use scanned models for heads."  ],
  ["The Island of Dr. Moreau",1996,"First film to use motion capture CGI to portray a character."  ],
  ["DragonHeart",1996,"First 2D all-CGI backgrounds with live actors. First film to use ILM's Caricature software (created during the film's production)."  ],
  ["Beast Wars: Transformers",1996,"First CGI Transformers animated series produced by Mainframe Entertainment. Sequel to the original Transformers."  ],
  ["Star Wars(Episodes IV, V and VISpecial Editions)",1997,"First re-release of a film to incorporate CGI characters and elements."  ],
  ["Marvin the Martian in 3D",1997,"First CG film created for viewing with 3D glasses."  ],
  ["Titanic",1997,"First wide-release feature film with major elements rendered under the open-source Linux operating system.[33] Also included a number of advances, specifically in the rendering of flowing water."  ],
  ["A Bug's Life",1998,"First CG anamorphic widescreen film. First all-digital transfer to DVD. First film to be reframed for home video releases."  ],
  ["Invasion: Earth",1998,"First major use of digital effects in a British TV series"  ],
  ["What Dreams May Come",1998,"First use of 3D CGI in combination with 3D location scanning (Lidar) and motion-analysis based 3D camera tracking in a feature film."  ],
  ["Fight Club",1999,"First photogrammetry based virtual cinematography scenes, including the first bullet time sex scene with fully naked body renderings of famous actors in leading roles (Helena Bonham Carter, Brad Pitt); renderings of different settings with both extreme close-ups and wide shots; and the first very photorealistic close-up rendering of a human face - which also belongs to a famous actor in a leading role (Edward Norton) - with detailed facial deformation and extreme close-ups (starting at the cell-level of the brain, flying through the different layers of tissues, a follicle and the skin with sweat droplets)."  ],
  ["The Matrix",1999,"First use of CG interpolation with bullet time effects. Added to the National Film Registry in 2012."  ],
  ["Star Wars: Episode I   The Phantom Menace",1999,"First film to use CG extensively for thousands of shots, including backgrounds, environmental effects, vehicles, and crowds. Several CG characters stood alongside real actors in dozens of shots, making them the first CG \"supporting\" cast members."  ],
  ["Final Fantasy: The Spirits Within",2001,"First feature-length digital film to be made based on photorealism and live action principles. The first theatrically released feature film to utilize performance capture (motion capture) for all of its characters actions.[34]"  ],
  ["Jimmy Neutron: Boy Genius",2001,"First CGI feature-length movie made using off-the-shelf hardware and software."  ],
  ["The Lord of the Rings: The Fellowship of the Ring",2001,"First use of AI for digital actors (using the Massive software developed by Weta Digital)."  ],
  ["The Lord of the Rings: The Two Towers",2002,"First virtual actor to win an award (Critics' Choice Movie Awards by Andy Serkis playing Gollum), in the newly created category Best Digital Acting Performance"  ],
  ["Ice Age",2002,"First full-length feature animated film exclusively rendered with a ray tracer (CGI Studio).[35]"  ],
  ["The Matrix Reloaded",2003,"The Burly Brawl - the first use of \"Universal Capture\", the combination of dense (rather than point-based) motion capture, per-frame texturecapture and optical flow of pixels over the data from 7 camera setupbought into a shared UV space by projection onto a neutral expression geometry leading to the introduction of realistic digital look-alikes, last missing piece into puzzle to make fully virtual cinematography possible."  ],
  ["Able Edwards",2004,"First movie shot completely on a green screen using digitally scanned images as backgrounds."  ],
  ["Sky Captain and the World of Tomorrow",2004,"First movie with all-CGI backgrounds and live actors.[36]"  ],
  ["The Polar Express",2004,"First computer-animated 3D film to be created with motion capture."  ],
  ["Elephants Dream",2006,"First CGI short movie released as completely open source. Made with open-source software, theatrical and DVD release under Creative Commons License.[37] Unique that all 3D models, animatics and software are included on the DVD free for any use."  ],
  ["Flatland",2007,"First CGI feature film to be animated by one person. Made with Lightwave 3D and Adobe After Effects.[38]"  ],
  ["Plum feros",2009,"First CGI feature-length movie made using Open Source/Free Softwarefor all 3D models, animation, lighting and render process, under GNU/Linux operating system."  ],
  ["Avatar",2009,"First full-length movie made using performance capture to create photorealistic 3D characters and to feature a fully CG 3D photorealistic world. The first virtual art department and complete virtual production pipeline was developed by director James Cameron and team to create the film in real-time."  ],
  ["Up",2009,"First computer-animated feature to be nominated for Academy Award for Best Picture."  ]
]
